In [1]:
import pandas as pd
import numpy as np

In [7]:
s = pd.Series([1,2,-3,-5], name = 'Numbers')
s

0    1
1    2
2   -3
3   -5
Name: Numbers, dtype: int64

In [6]:
sq = pd.Series(np.square(s), name = 'sqaures')
sq

0     1
1     4
2     9
3    25
Name: sqaures, dtype: int64

In [16]:
s1 = np.random.rand(5,2)
s1_s = pd.DataFrame(s1,columns = ['c1','c2'])
s1_s

         c1        c2
0  0.344018  0.816111
1  0.176609  0.736780
2  0.435307  0.289506
3  0.765063  0.394969
4  0.235130  0.299979

In [18]:
s

0    1
1    2
2   -3
3   -5
Name: Numbers, dtype: int64

In [17]:
s + [1000,2000,3000,4000]

0    1001
1    2002
2    2997
3    3995
Name: Numbers, dtype: int64

In [22]:
s1_s + 1000 #,2000]#,3000,4000,5000]

            c1           c2
0  1000.344018  1000.816111
1  1000.176609  1000.736780
2  1000.435307  1000.289506
3  1000.765063  1000.394969
4  1000.235130  1000.299979

In [39]:
s1_s[s1_s['c1'] > 0.5]

         c1        c2
3  0.765063  0.394969

In [25]:
s1_s['c1']

0    0.344018
1    0.176609
2    0.435307
3    0.765063
4    0.235130
Name: c1, dtype: float64

In [36]:
lst = np.array([1,2,3,4,5])
lst[np.array([True, True, False, True, False])]

array([1, 2, 4])

In [41]:
x = pd.Series([1,2,3,4,5,6], index=['one', 'two','three','four','five','six'], name = 'Test')
x

one      1
two      2
three    3
four     4
five     5
six      6
Name: Test, dtype: int64

In [42]:
y = pd.Series([10,20,30], index = ['One', 'two', 'three'], name = 'Test_1')
y

One      10
two      20
three    30
Name: Test_1, dtype: int64

In [52]:
x_1 = pd.concat([x,y], axis = 1)
x_1

       Test  Test_1
one     1.0     NaN
two     2.0    20.0
three   3.0    30.0
four    4.0     NaN
five    5.0     NaN
six     6.0     NaN
One     NaN    10.0

In [53]:
type(x_1)

pandas.core.frame.DataFrame

In [71]:
m_2 = pd.DataFrame({x.name:x, y.name:y}).sort_values(by = 'Test')
m_2

       Test  Test_1
one     1.0     NaN
two     2.0    20.0
three   3.0    30.0
four    4.0     NaN
five    5.0     NaN
six     6.0     NaN
One     NaN    10.0

In [69]:
z = list(m_2.index)
z.sort()
z

['One', 'five', 'four', 'one', 'six', 'three', 'two']